Control_Test/Darrious/GA_Blade/CFD_Test/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0096;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        value           uniform 0.0096;
    }

    outlet 
    {
        type            zeroGradient;
    }

    "(VAWT1|VAWT2|VAWT3|SHAFT)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    top
    {
	type            zeroGradient;
    }
    bottom
    {
	type            zeroGradient;
    }
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }



}


// ************************************************************************* //
